---
kind: type
id: T:Autodesk.Revit.DB.Analysis.ConceptualConstructionFloorSlabType
source: html/82690260-73b8-b923-99e0-ef6f66a0eb66.htm
---
# Autodesk.Revit.DB.Analysis.ConceptualConstructionFloorSlabType

ConceptualConstructionType values for Floors.

## Syntax (C#)
```csharp
public enum ConceptualConstructionFloorSlabType
```